#include<stdio.h>
//int main()
//{
//	char a = -1;
//	//1000000000000000000000000000001
//	//1111111111111111111111111111110
//	//1111111111111111111111111111111
//	//11111111
//	signed char b = -1;
//	//11111111
//	unsigned char c = -1;
//	//11111111
//	printf("a= %d, b=%d, c=%d", a, b, c);
//	//进行整形提升
//	//a 1111111111111111111111111111111 将最高位看成符号位进行整形提升 -1
//	//b 1111111111111111111111111111111 -1
//	//c c为无符号数进行整形提升时补零
//	//c 0000000000000000000000011111111 255
//	return 0;
//}

//int main()
//{
//	char a = -128;
//	//1000000000000000000000000010000000
//	//1111111111111111111111111101111111
//	//1111111111111111111111111110000000
//	//10000000
//	//1111111111111111111111111110000000 整形提升之后的结果
//	//无符号数的原码反码补码相同
//	printf("%u\n", a);//%d - 打印十进制的有符号数字 %u - 打印十进制的无符号数字
//	//所以提升后的原码为1111111111111111111111111110000000
////}4294967168

//int main()
//{
//	char a = 128;//char 的范围是-128 - 128， 128相当于127+1 由于最大为127， 故127+1，变成-128
//	printf("%u\n", a);//所以此题结果和上一题相同
//	return 0;
//}

//int main()
//{
//	int i = -20;
//	//补码 11111111 11111111 11111111 11101100
//	unsigned int j = 10;
//	//补码 00000000 00000000 00000000 00001010
//	printf("%d\n", i + j);
//	//i+j  11111111 11111111 11111111 11110110 补码
//	//i+j  11111111 11111111 11111111 11110101 反码
//	//i+j  10000000 00000000 00000000 00001010 补码 -10
//	return 0;
//}

//#include<windows.h>
//int main()
//{
//	unsigned int i;//因为是无符号数所以循环一直进行为死循环
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//		Sleep(100);
//	}
//	return 0;
//}

//int main()
//{
//	char a[1000];//char类型的取值范围为-128~127之间
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));//strlen统计大小时统计的是\0前的空间
//	return 0;
//}//255

//unsigned char i = 0;
//int main()
//{
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello world\n");//unsigned char 的取值范围是0~255，循环总是满足条件死循环。
//	}
//	return 0;
//}

//int main()
//{
//	double d = 1E10;
//	printf("%lf\n", d);
//	return 0;
//}

int main()
{
	int n = 9;
  //00000000000000000000000000001001补码
	float* pFloat = (float*)&n;
	printf("n的值为：%d\n", n);
	printf("*pFloat的值为：%f\n", *pFloat);
	//0 00000000 00000000000000000001001
 //(-1)^0*0.00000000000000000001001 * 2^-126
 
	*pFloat = 9.0;
 //1001.0
 //1.001*2^3
 //(-1)^0 * 1.001 * 2^3
 //0 10000010 00100000000000000000
	printf("num的值为：%d\n", n);//109157616
 //01000001000100000000000000000 补码
	printf("*pFloat的值为：%f\n", *pFloat);//9.0
	return 0;
}

//int main()
//{
//	float f = 5.5;
//	//5.5
//	//101.1
//	//(-1)^0*1.011*2^2
//	//M = 1.011
//	//s=0
//	//E = 2 2+127 
//	//0 10000001 01100000000000000000000
//	//0100 0000 1011 0000 0000 0000 0000 0000
//	//E不为全0或不为全1
// //E为全零时浮点数的指针E等于1-127（或者1-1023）有效数字M不再加上第一位的1
//	//0x40b00000
//	return 0;
//}